<template lang="jade">
  .hello
    .ui.segment.container
      p 如果真的要說有什麼特別，我會比較注意飲食裡除了米飯和麵粉，也要有其他五穀雜糧，有時以其他澱粉當主食，例如其中一兩餐不是吃飯／麵，而是吃小米、芋頭、南瓜、地瓜、山藥直接當主食等。

      p 例如前幾天的早餐是催芽綠豆與糙薏仁，加點南瓜、椰棗調味的清爽甜湯。

      p 我有時也會煮燕麥，私心很喜歡燕麥粒的風味與口感，它也是黏性比較低的澱粉，吃起來感覺很舒服。請注意這邊是說燕麥粒，不是燕麥片，燕麥粒好煮好嚼，可Ｑ可軟，可甜可鹹可搭配米飯一起煮，很好用。

      p 蓮藕高湯單煮非常好喝，混搭燕麥有點澱粉濃稠感也很棒，有時這就是我們家的主食！特別前陣子蓮藕產季，喜歡煮蓮藕燕麥湯！小太陽喜歡這種雜糧或五穀根莖（例如牛蒡）的清湯，風味好，營養又好吸收。

      p 我每次邊煮邊忍不住數落看過的嬰幼兒食譜書，一方面根本沒什麼特別的，台灣很多特有的五穀雜糧、根莖類幾乎沒出現，或只有一兩道就沒了。二來覺得嬰兒食譜書的葷食太多，BABY並不一定需要這麼多動物性蛋白質。至少我們家小朋友全母奶＋全蔬食，兩年來都健健康康，幾乎完全沒生病（唯二兩次鮮明發燒都是免疫系統升級，活動力正常也好得快）

      p 我的經驗是，均衡的雜糧蔬食、不過度調味，比在意有沒有吃到肉啊蛋啊來得重要。^_^
    .ui.segment.container
      p 我當初覺得
      p 在醫院生產後，胎盤大多當廢棄物被處理掉吧
      p 居家生，把胎盤當垃圾丟棄或放廚餘桶...感受上都怪怪的
      p 我也不愛弄拓印（弄完一樣要丟掉／埋掉）

      p 助產師說這有營養，也確實可食用，問我要不要吃
      p 我說好啊

      p 於是生產完當天就吃了一點
      p 為了增加入口接受度，助產師教的料理是炒薑、米酒、醬油
      p 她教宗浩怎麼做（分成小袋裝冷凍，直接丟鍋子炒）
      p 然後我接著吃了三天的胎盤當早餐配菜

      p 有人說胎盤超級營養
      p 有人說胎盤有身體上的毒素，建議不要吃
      p 每種說法各有它的理由
      p 但我覺得最重要的是自己的想法
      p 因為每個人的意念會讓身心是個動態的變化

      p 好啦離題了

      p 我本能覺得胎盤不是垃圾或廢棄物
      p 也並不覺得這可愛的小生命到世界上
      p 我產後就得吃掉很多動物『進補』
      p 因此打算吃自己的，不浪費可利用的
      p 沒道理可以『自補』卻不食，去吃別的動物吧

      p 我覺得很多人因為在醫院生產
      p 不太容易保存胎盤做料理
      p 但還是可以參考下
      p 貼過來分享：）
</template>

<script>
export default {
  name: 'Thoughts',
  data () {
    return {
    }
  },
  methods: {
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

p {
  font-size: 16px;
  line-height: 1.6;
  text-align: left;
}
</style>
