<template lang="jade">
  #app
    .ui.menu
      router-link.item(to="/" exact='')
        i.home.icon
        span.fat-only 首頁
      router-link.item(to="/foods" exact='')
        i.book.icon
        span.fat-only 食譜
      router-link.item(to="/thoughts" exact='')
        i.comments.icon
        span.fat-only 飲食小記
      router-link.item(to="/baby" exact='')
        i.user.icon
        span.fat-only 嬰幼兒
        span.fat-only 食譜
      router-link.item(to="/outer" exact='')
        i.sign.language.icon
        span.fat-only 資源
      .right.menu.fat-only
        .item
          iframe(src="https://www.facebook.com/plugins/share_button.php?href=https%3A%2F%2Ffood.bestian.tw&layout=button&size=small&mobile_iframe=true&appId=485195848253155&width=63&height=20" width="63" height="20" style="border:none;overflow:hidden" scrolling="no" frameborder="0" allowTransparency="true" allow="encrypted-media")
    #main
      router-view(:foods = "foods")
</template>

<script>
export default {
  name: 'App',
  data () {
    return {
      foods: [
        // {
        //  t: '絲瓜蛤蠣湯',
        //  i: '絲瓜蛤蠣湯.jpg',
        //  p: [
        //    '絲瓜削皮，半月切',
        //    '與蛤蠣一起煮',
        //    '加一點鹽'
        //  ]},
        {
          t: '青木瓜、玉米、蓮藕雜煮',
          i: '青木瓜、玉米、蓮藕雜煮.jpg',
          p: [
            '青木瓜、玉米、蓮藕切丁',
            '把它們煮在一起，直接當主食']},
        {
          t: '南瓜豆漿',
          b: true,
          i: '南瓜湯.jpg',
          p: [
            '南瓜切丁煮熟，混到無糖豆漿裡，很營養，小孩喝也很好。']},
        {
          t: '米糠茴香煎餅',
          i: '米糠茴香煎餅.jpg',
          p: [
            '米糠粉、麵粉、新鮮茴香',
            '米糠與麵粉大約1:2，似乎再多一點也OK',
            '不用任何調味，細細咀嚼，有微甜，很好吃']},
        {t: '紅藜薑黃蘿蔔糕',
          i: '紅藜薑黃蘿蔔糕.jpg',
          b: true,
          p: ['蘿蔔糕：在來米、梗米、地瓜粉',
            '（在來米1.5碗、梗米0.5碗、地瓜粉約半碗，每種都是隨興加的）',
            '口感Q嫩，非常像早餐店那種軟軟的蘿蔔糕，下次要用這個配方做芋頭粿～']},
        {t: '牛蒡紅豆年糕',
          i: '紅豆年糕.jpg',
          b: true,
          p: ['這次年糕加了：糯米、梗米、台灣紅藜、地瓜粉',
            '紅豆有先催芽',
            '順手加入黑糖煮乾燥牛蒡片的甜湯',
            '蒸熟後，融合在一起的味道很棒',
            '外面賣的年糕都太甜了！',
            '自製年糕／麻糬真的又快又好吃喲，經濟實惠^_^']},
        {t: '芭蕉+芝麻椰奶\n米布丁',
          i: '米布丁.jpg',
          p: ['冷水、米粉、冷水煮沸',
            '以上以碗為單位，2:2:2',
            '比例上，水可以再多一點，口感比較嫩，例如水改3碗。',
            'A :冷水拌在來米粉（有其他料等拌勻再放，或料先放B，避免米粉結塊。）可直接試味道，嚐起來不夠甜再加糖。',
            'B :將A倒入煮沸熱水中慢慢攪拌（均勻中小火），有些稠度後，放入容器，電鍋蒸熟。',
            '剛蒸熟太軟，放涼口感較好。']},
        {t: '椰奶紅豆米布丁', i: '椰奶紅豆米布丁.jpg'},
        {t: '麻糬+炒紅豆沙', i: '麻糬+炒紅豆沙.jpg', b: true, p: ['糯米先浸泡，打成漿後蒸熟。這種做法，白糯米黏性比『純紫糯米or純糯小米』打漿後的黏性高，因此後兩種口味，建議混搭白糯米一起打漿。', '炒紅豆沙：煮好的紅豆撈出來，只要水瀝乾、均勻小火，炒起來很快乾，要多甜，自在隨意。自製紅豆沙超級好吃。']},
        {t: '小米麻糬+金時芋蘋婆醬', i: '小米麻糬.jpg', b: true, p: ['小米麻糬沾白芝麻，餡料是金時芋+蘋婆，再加點二號砂調味。這個餡料本身當甜點很好吃。']},
        {t: '小米麻糬烏龍麵（應用補充）', i: '小米麻糬-烏龍麵.jpg', p: ['柴魚味噌湯加小米麻糬非常好吃呀，任何糯米先泡水打漿再蒸熟吃起來就不黏牙，充滿糯米香，簡單料理卻能有各種可能性。不懂怎麼很少見到小米麻糬相關料理。', '另外，將小米麻糬與冰箱剩存的紅燒紅麴滷汁（再加入蒜頭、生抽壺底醬油），拌著醬吃，風味有像吃肉圓~', '小米粥、小米綠豆糊、小米＋紅藜+胚芽米飯、小米甜／鹹麻糬料理...台灣自產的糯小米，營養又好料理喔^^']},
        {t: '味噌蔬菜烏龍麵', i: '味噌蔬菜烏龍麵.jpg', b: true, p: ['加了台灣藜、少許芋頭、海苔。味噌和芋頭很搭配。']},
        {t: '蘋婆黃醬燉飯', i: '蘋婆黃醬燉飯.jpg', b: true, p: ['如果剛好買到不甜的地瓜，試試看鹹煮吧！例如跟油豆包一起紅燒，很搭配喔。', '這次把不甜的地瓜跟蘋婆一起打泥，口感溫和綿密，黃醬拿來煮蔬菜濃湯、燉飯、義大利麵都非常好吃（此款黃醬煮蔬食特別契合，裡裡外外透著一股溫和']},
        {t: '薑黃烤餅', i: '薑黃烤餅.jpg', b: true, p: ['使用上下游市集的「台灣好好小麥粉」、福和自然田園的薑黃粉，直接用鐵鍋乾煎就是好吃的捲餅，訣竅是餅皮要薄一點，拍點麵粉不黏手再煎，風味有點像外面賣的印度甩餅，乾麵粉有烤過的香氣，餅皮脆中帶軟有嚼勁，有點薑黃香氣。煎薄餅很快。']},
        {t: '藜麥酪梨沙拉', i: '藜麥酪梨沙拉.jpg', b: true, p: ['酪梨、番茄、小黃瓜、地瓜、蘋果', '拌上無奶蛋的沙拉醬', '混搭白藜麥感覺也不錯，有陣子這樣當早餐吃：）', '同樣原料，改淋芥末醬油、泰式酸辣醬，又是不同風味']},
        {t: '潤餅皮應用', i: '中式蛋捲潤餅皮.jpg', b: true, p: ['發現潤餅皮很好用，比吐司Q、薄、有嚼勁、好入味，很適合當點心呢～', '潤餅皮也可冷凍（要封好），直接拿出來退冰，或電鍋稍微蒸過即可食。用電鍋蒸氣潤過的餅皮口感較好。愛抹什麼醬，隨意抹。', '也可以包任何沙拉、鹹食，簡直百搭好用。']},
        {t: '芝麻潤餅旦捲', i: '芝麻卷.jpg', b: true, p: ['誰說甜味旦捲一定要酥酥脆脆呢，孩子用潤餅皮DIY當旦捲，吃的很樂，不烘不烤即可食的中式旦捲~']},
        {t: '綠茶麻糬+紅豆', i: '綠茶麻糬+紅豆.jpg', b: true, p: ['白麻糬沾綠茶粉，end.']},
        {t: '宇宙紫甜湯', i: '宇宙紫甜湯.jpg', b: true, p: ['家裡小孩想吃「宇宙紫」的麻糬', '用甜菜根汁+蝶豆花染成紫色甜湯', '甜菜根是之前當季買的，打汁後罐裝冷凍，染色好用。（可拿來做麵團黏土，顏色鮮豔）', '鍋裡的深色沈澱是打碎的甜菜根']},
        {t: '薑黃椰油抹醬', i: '薑黃椰油抹醬.jpg', b: true, p: ['薑黃粉+黑糖+椰油拌勻當麵包抹醬（非常非常好吃！）']},
        {t: '雙色紅豆麻糬', i: '雙色紅豆麻糬.jpg', b: true, p: ['一層白糯米漿先蒸成型，再倒入小米+白糯米漿，做出來很像早期雜貨店的蛋黃&蛋白軟糖~滿可愛的。也像水煮蛋丁。', '麻糬用鐵便當盒蒸很方便，多做可直接冷凍，要吃再用電鍋蒸，口感不變。']},
        {t: '牛蒡桂圓紅豆湯麻糬', i: '牛蒡桂圓紅豆湯麻糬.jpg', b: true, p: ['甜湯+麻糬應用~', '自家小孩很愛紅豆跟麻糬，因此常出現這兩款食材。']},
        {t: '葉香飯', i: '葉子蒸飯.jpg', b: true, p: ['野薑花葉裹-胚芽小米飯', '搭配南瓜杏香菇鹹蛋食用', '又快要端午節了，我覺得如果是一家人吃一餐，這樣吃個『大餅粽』也滿有Fu的啦，不用一個個捆了又拆，而且葉子飯滿有Fu的～', '一種不需要研究粽子包法的新樂趣', '也可以用任何食用薑的葉子、芭蕉、荷花、月桃葉試試', '月桃葉的香氣十分獨特，怎麼包都會入味，野薑花葉的優點是特別軟，放進鍋子好擺放。', '照片中是梗米，不是糯米，比較好消化，', '另加了小米，讓葉子與米飯間更密實。', '煮飯比例的水量即可，也可以多點水，讓米飯比較濕潤、入味。', '葉片不需抹油，完全不沾黏。包好後，最上方壓個盤子、蓋上鍋蓋，悶煮更入味~', '曾經嘗試過的還有：', '月桃葉：南瓜小米飯（原味／鹹味-加菜脯、紅蔥頭、香菇）', '粽葉：紅藜紅豆栗子／南瓜粽（原味／鹹味）']},
        {t: '紫米粽葉炊飯', i: '紫米粽葉炊飯.jpg', p: ['蒸好打開來有點像昆布，哈！', '原味葉子飯香單純，想吃鹹就拌點炒料，吃甜的就沾黑糖粉，很彈性。']},
        {t: '紅藜香蕉飯', i: '紅藜香蕉飯.jpg', p: ['紅藜香蕉飯（香蕉、黑糖適量，以香蕉葉包飯）', '米我是用四季耕讀的五分米（糙米殼去一半的米），不用糯米']},
        {t: '椰奶白醬燉飯', i: '椰奶白醬燉飯.jpg', b: true, p: ['省時料理，加個水把冷凍馬鈴薯丁、三色蔬菜、剩飯（紅藜胚芽米）煮一煮，加上水、椰奶、高麗菜調味就行了。 ', '完全就是白醬奶香風味喔^^']},
        {t: '椰奶南瓜紅豆（鹹）', i: '椰奶南瓜紅豆（鹹）.jpg', p: ['南瓜先煮，再加蔬菜、蒸好的紅豆、椰奶、鹽調味', '紅豆跟南瓜都可以作主食。', '這好像是某天的一餐。']},
        {t: '椰奶黃醬-蔬菜燉煮', i: '椰奶白醬-蔬菜燉煮.jpg', b: true, p: ['椰奶非常適合做白醬，不想吃太多鮮奶油、又喜歡白醬風味的可以參考。']},
        {t: '南瓜義大利麵', i: '南瓜義大利麵.jpg', b: true, p: ['愛南瓜！椰奶南瓜義麵，非常好吃（口水）']},
        {t: '椰奶紅豆＋黑糖麻糬', i: '椰奶紅豆－黑糖麻糬.jpg', b: true, p: ['麻糬冷藏後拿出來切，看著有點像切片蛋糕www', '要再蒸過才能吃！只是拍照好看~', '加了點黑糖的麻糬，其實也是年糕啦。']},
        {t: '椰奶紅糯米麻糬', i: '椰奶紅糯米麻糬.jpg', b: true, p: ['紅糯米+白糯米製作的麻糬', '淋上椰奶、黑糖，非常有南洋風味喔！']},
        {t: '香蕉煎餅', i: '香蕉煎餅.jpg', b: true, p: ['香蕉、地瓜粉、糙米粉、極少許水', '全部拌在一起油煎，甜甜香香的。有陣子我們全家吃超級多。', '我用的是『佳實糙米米穀粉』，上下游市集可買到，粉很細，口感跟白米米穀粉一樣，推薦糙米的。', '米粉混地瓜粉可以煎其他種餅，或做米疙瘩、米糕、勾芡。']},
        {t: '紅糯米麻糬', i: '紅糯米麻糬.jpg', b: true, p: ['紅糯米、白糯米、梗米混搭的黑糖麻糬', '超級推薦', '紅糯米麻糬香氣非常棒']},
        {t: '米疙瘩', i: '米疙瘩.jpg', b: true, p: ['跟麵疙撘一樣，非常快熟，口感好，充滿淡淡芋米香，適合想吃米食又沒煮飯的人。方便。', '我用的是『佳實糙米米穀粉』。']},
        {t: '鷹嘴豆＋燕麥胚芽米飯', i: '鷹嘴豆＋燕麥胚芽米飯.jpg', b: true},
        {t: '南瓜小米粥', i: '南瓜小米粥.jpg', b: true, p: ['溫和的南瓜小米粥，愛']},
        {t: '芋頭鹹粿', i: '芋頭鹹粿.jpg', b: true, p: ['因為不想吃全糯米，因此加了梗米一起打漿作粿。', '跟做麻糬一樣，生米浸泡後打漿，生米漿放置一段時間後，倒掉浮在上方的水，增加米漿濃稠度，再拌入鹹鹹的炒料（湯汁不要太多），放電鍋蒸熟，這就行啦！芋頭跟醬油搭配超香，好吃！', '鍋子裡如果墊著月桃葉一起蒸，另有一番風味喲～']},
        {t: '紅豆湯', i: '紅豆湯.jpg', b: true, p: ['紅豆湯（紅棗、南瓜、栗子、地瓜）', '紅豆湯的湯頭，我喜歡加點乾燥牛蒡', '有時候會加點自製麻糬、薑粉。']},
        {t: '椰棗燕麥粥', i: '椰棗燕麥粥.jpg', b: true, p: ['椰棗跟椰子沒有關係', '是另一種植物', '果實非常甜可以當代糖，風味溫和，有它迷人之處', '我通常把椰棗切一切加點水，用果汁機打椰棗醬，用途很廣。', '用椰棗調味的燕麥粥非常好吃。粥裡好像也有加點南瓜／地瓜。']},
        {t: '蓮藕燕麥粥', i: '蓮藕燕麥粥.jpg', b: true, p: ['先煮蓮藕，等蓮藕煮好再加燕麥粒也OK', '因為蓮藕不怕燉煮，燕麥粒很好煮熟，煮久會爆開，一樣好吃有嚼感。', '燕麥粒可以事先浸泡，也可以不浸泡直接煮，', '蓮藕燕麥煮出來的原味高湯超好喝，當嬰兒副食品很棒。', '燕麥粒煮水的湯，冷藏隔天會有膠質凍呢，紅豆燕麥粒的高湯也很棒。', '雜糧清煮的好處是沒吃完的話，隔天打漿、簡單調味也是很好的飲料／點心。（像是芋頭、胚芽米打漿後加椰奶、黑糖也很美味！）']},
        {t: '紅豆天貝+蔬菜糙米飯', i: '紅豆天貝+蔬菜糙米飯.jpg', b: true, p: ['天貝是什麼，請直接google，不同豆子做的天貝，風味不太一樣。']},
        {t: '家常菜飯+煎蘿蔔排\n', i: '薑黃糙米飯.jpg', b: true, p: ['超超超超好吃的蘿蔔排，用煎完蘿蔔的麻油炒青菜，配上糙米飯、灑點薑黃粉，哇！！！']},
        {t: '蔬食隨手煮', i: '蔬食隨手煮.jpg', p: ['（喜願米麵條）拌紫蘇葉、醬油等調味', '絲瓜蔬菜', '牛蒡紅藜清湯']},
        {t: '南瓜米糕', i: '南瓜米糕.jpg', b: true, p: ['南瓜在來米糕配新鮮的亞麻仁油、醬油']},
        {t: '黃耆當歸蔬麵', i: '黃耆當歸蔬麵.jpg', b: true, p: ['黃耆、當歸、紅棗湯底，濾過留下紅棗，加名豐油豆包、鮮菇、青菜，就是好吃的蔬食補湯麵^_^']},
        {t: '味噌湯＆烏龍麵', i: '味噌湯＆烏龍麵.jpg', b: true, p: ['茄子吸油，與油豆包、花椰菜很對味，這款味噌湯我會煮多一點的量，隔天再加點烏龍麵、馬鈴薯、味噌，成為濃郁的烏龍湯麵。']},
        {t: '薑黃鮮菇飯', i: '薑黃鮮菇飯.jpg', b: true, p: ['鮮菇直接用手撕開加點鹽拌炒，加入薑黃粉、少許水，最後直接和煮好的米飯拌在一起。不習慣薑黃味就少加一點。有淡淡香氣、適合慢慢咀嚼滋味的拌飯。', '是從《幸福市集》這本書學的做法，裡面還有不少簡單好吃的原味料理～']},
        {t: '樹豆料理', i: '樹豆料理.jpg', b: true, p: ['樹豆！她本身有自己的豆子香氣，較硬，建議先泡水，我通常會先用電鍋煮熟，煮米飯或煮料理再丟下去一起煮，吃起來比較軟。一次燉久一點也會軟。', '吃樹豆會長精神喲，有蛋白質和各種營養，也很有飽食感，咀嚼樹豆，總有一種完整的滿足喜悅，身體好像在跟我傳達，是的，我就是想吃這樣的食物！', '我煮過樹豆青木瓜湯、紅燒湯、樹豆咖哩、樹豆排骨、沙拉、樹納豆...各有風味，其實直接加到米飯裡煮就很好吃，雖然已經煮軟，但嚼起豆子，吃飯也會放慢品嚐。']},
        {t: '天貝南瓜蔬菜麵', i: '天貝南瓜蔬菜麵.jpg', b: true, p: ['照片中是紅豆天貝、黃豆天貝天貝吃起來有點鮮菇的味道。它本來就是菌跟豆子作用的發酵食品，像納豆那樣。天貝要單獨煎，跟煎豆干類似，吃起來帶著油香。']},
        {t: '月桃南瓜小米飯', i: '月桃南瓜小米飯.jpg', b: true, p: ['微微鹹的月桃南瓜小米飯（五分米、小米、南瓜、香菇、紅蔥頭、菜脯）', '我是用煮好的飯XD只是好玩，試試看包入葉中冷凍，當成粽子飯吃。']},
        {t: '粽葉、香蕉葉、月桃葉', i: '粽葉、香蕉葉、月桃葉.jpg', p: ['由左至右', '粽葉、香蕉葉、月桃葉']},
        {t: '豆鼓炒黑豆芽', i: '豆鼓炒黑豆芽.jpg', p: ['自己種的黑豆芽菜']},
        {t: '秈稻薑黃飯', i: '秈稻薑黃飯.jpg', b: true, p: ['薑黃飯煮好後，抹一點鹽麴，配上碗豆、蔬菜，也可以加少許冷壓椰油，令人驚豔的清爽美味。']},
        {t: '納豆山藥泥', i: '納豆山藥泥.jpg', b: true, p: ['生山藥泥非常綿密，加上海苔、醬油當主食，好搭配。']},
        {t: '糙米納豆飯', i: '糙米納豆飯.jpg', b: true},
        {t: '味噌薑醋海帶飯', i: '味噌薑醋海帶飯.jpg', b: true, p: ['味噌、蘿蔔泥、薑醋、海帶醬與米飯拌勻，吃起來像壽司飯糰，很清爽，搭配玉米、豌豆莢、蔬菜盤...這是去陽明山探路的野餐便當^^']},
        {t: '蜂蜜肉桂小米麻糬', i: '蜂蜜肉桂小米麻糬.jpg', b: true, p: ['肉桂麻糬好好吃啊', '肉桂粉混搭薑粉的麻糬應該也不錯']},
        {t: '蘿蔔糕配芝麻葉', i: '蘿蔔糕配芝麻葉.jpg', b: true},
        {t: '艾草醬米糕、青菜', i: '艾草醬米糕、青菜.jpg', b: true, p: ['新鮮艾草切碎搭配素燥醬', '在來米糕加了糙米，配蔬菜享用']},
        {t: '鹹小米麻糬－艾草醬、少許黑米', i: '鹹小米麻糬－艾草醬、少許黑米.jpg', b: true},
        {t: '地瓜夾鹹綠豆沙', i: '地瓜夾薑炒鹹綠豆沙.jpg', b: true, p: ['這是有一年過年聚餐，我做的點心。', '綠豆加鹽麴、薑泥一起炒，就是好吃的鹹綠豆沙，和甜甜的地瓜很搭配。', '因為喜歡草籽粿鹹綠豆口味，靈光一現把鹹綠豆沙夾在地瓜裡～這過程有點厚工，其實地瓜切片直接抹鹹綠豆沙就行了']},
        {t: '免揉麵團-薑汁肉桂葡萄乾', i: '薑汁肉桂葡萄乾麵包.jpg', b: true, p: ['薑汁肉桂+葡萄乾很搭配', '這個免揉麵團配方，讓人省了很多力氣，我是蒸熟吃（喜歡蒸勝於烤麵團）吃起來是很有嚼感麵包。（還是必須叫饅頭？）', ' 免揉麵團做法：（我是用三匙麵粉+加一匙全麥的比例）http://e7453268.pixnet.net/blog/post/304594190-%E5%85%A8%E9%BA%A5%E6%B3%95%E5%9C%8B%E9%BA%B5%E5%8C%85%28%E5%85%8D%E6%8F%89%E4%B8%80%29?fbclid=IwAR1APmZompDebFZr-LrJFhJMYpOH_URPNeOLjQG3-xw4lREIEXun_24Diks']},
        {t: '薑黃黑胡椒麵包', i: '薑黃黑胡椒麵包.jpg', b: true, p: ['薑黃是用新鮮薑黃打汁做的，長時間發酵，薑黃汁麵團表層的顏色會比較暗，但揉一揉就看不出來了。用薑黃粉就不會這樣，但這兩種風味不太一樣。']},
        {t: '紫米紅棗麵包', i: '紫米紅棗麵包.jpg', b: true, p: ['紅棗口味的蒸麵包，風味很好，紫米和紅棗搭配的口味也很棒，各有特色。紫米是另外煮熟，麵團發酵完畢才再混進去的。']},
        {t: '蔬菜咖哩炒三色關廟麵', i: '蔬菜咖哩炒三色關廟麵.jpg', b: true},
        {t: '蔬食紅醬義麵', i: '蔬食紅醬義麵.jpg', b: true},
        {t: '全麥瓠子蒸餅', i: '全麥瓠子蒸餅.jpg', b: true, p: ['胡瓜絲、紅蘿蔔絲、全麥麵粉，調味（鹽、白胡椒等）蒸熟後，淋上麻油蔥花醬']},
        {t: '紅燒粉絲', i: '紅燒粉絲.jpg', b: true, p: ['全以老菜脯、帶殼龍眼乾調味的紅燒粉絲', '有個感覺就是要連殼一起煮，放心，並不會吃到殼....']},
        {t: '洋蔥白蘿蔔絲全麥麵糕-素肉羹', i: '洋蔥白蘿蔔絲全麥麵糕.jpg', b: true, p: ['以上材料，加入胡椒鹽、少許麻油，整鍋麵糊蒸熟，用湯匙挖一勺勺，滋味有鹹有甜有香，有像肉羹，素食店或可考慮棄素料，用這樣的真食物做素羹。']},
        {t: '樹豆納豆', i: '樹豆納豆.jpg', b: true, p: ['花了幾天催芽，昨晚用電鍋嘗試－樹豆納豆，算是成功啦！', '樹豆要煮軟比黃豆快，所以我用樹豆。', '本日早餐：糙在來米、蕎麥、海苔、少許白蘿蔔泥、醬油、樹豆納豆。', '本來還有蔬菜雜煮湯，但吃完活生生的納豆飯就不想吃烹煮全熟的菜湯了。']},
        {t: '暖身餐1', i: '暖身餐1.jpg', b: true, p: ['南瓜、催芽紅豆、雙色地瓜、湯圓、無糖黑芝麻']},
        {t: '暖身餐2', i: '暖身餐2.jpg', b: true, p: ['紅棗、紅糯米、雙色地瓜、薑黃、薑片']},
        {t: '煎白蘿蔔', i: '煎白蘿蔔.jpg', p: ['煎白蘿蔔、自然農法柚子醬、豬乳母、味噌雜煮湯（芋頭地瓜豆腐）']},
        {t: '牛蒡山藥蔬菜味噌湯', i: '牛蒡山藥蔬菜味噌湯.jpg', p: ['牛蒡好東西，做涼拌菜好吃，煮湯有溫和的牛蒡香氣、甜味，', '照片是牛蒡山藥蔬菜味噌湯', '（牛蒡豆苗海苔味噌湯也很棒）:D']},
        {t: '炸醬', i: '炸醬.jpg', p: ['四片豆干、一顆半的洋蔥、紅蘿蔔、豆瓣醬適量', '（改用豆鼓和少量豆腐乳也很對味），', '煮起來很快，最左邊的圓盒就夠兩人份的拌量。']},
        {t: '耐人尋味番茄麵', i: '耐人尋味番茄麵.jpg', p: ['耐人尋味的好吃啊，步驟簡單，好吃的關鍵是下鍋手順與煮番茄的時間：）']},
        {t: '葛鬱金、蕃茄蔬菜燉煮', i: '葛鬱金、蕃茄蔬菜燉煮.jpg'},
        {t: '無敵拌麵', i: '無敵拌麵.jpg', p: ['加的冷水不超過麵粉的一半，', '例如500g麵粉配230g水，', '揉勻後靜置40分鐘醒麵，', '擀麵時撒點麵粉，切厚薄寬細隨喜，', '搭配喜歡的醬料與蔥花後，就是無敵拌麵啦：Ｄ']},
        {t: '蔬菜咖哩', i: '蔬菜咖哩.jpg', p: ['以米糠、薑黃汁當底的蔬菜咖哩', '冷凍生薑黃片打汁，並以米糠增加部分濃稠度，其實加點鹽調味，不做成咖哩也很棒。']},
        {t: '百香果醬', i: '百香果醬.jpg', p: ['用百香果殼的膠質煮百香果醬，google搜尋有作法，是用百香果殼的膠質做軟糖，我是做成果醬。膠質本身沒有味道，百香果醬我建議煮好先吃完全沒加糖的味道，再一點一點調味，我很驚訝的是，一旦額外加糖，果香的風味真的完全不一樣了，糖還得加到一個量，才會有滿意的味道。其實原本是不想加糖的，只是有蜂蜜沒用完，所以試著加加看～']},
        {t: '芋粿燒茄子', i: '芋粿燒茄子.jpg', p: ['福和的自然農法芋頭、四季耕讀的米糠、糯米、主婦聯盟的地瓜粉。', '實驗性，芋米漿鋪平在盤子上用電鍋蒸熟，切成條，拌豆鼓炒茄子，很對味。任何的米製品加入芋頭，真的多一股迷人風味....']},
        {t: '紫米紅棗饅頭', i: '紫米紅棗饅頭.jpg', p: ['紫米紅棗饅頭大推薦，麵團加入大量煮熟的紫米、去籽切塊的紅棗，非常非常迷人的香甜！我覺得比紫米桂圓好吃欸！', '照片不好看，那是麵團有加油、放進烤箱的紫米紅棗「麵包」，同樣的麵團蒸成饅頭好好吃呀～麵包比較乾一點。我愛水蒸的饅頭！推薦做做看，我沒另外加糖，風味非常棒！']},
        {t: '紅豆糯米粥', i: '紅豆糯米粥.jpg', b: true, p: ['自然農法紅豆、糙糯米、帶殼龍眼、台灣公館紅棗', '龍眼和紅棗有微甜，沒有另外放糖，吃起來感覺很溫和。']},
        {t: '蘿蔔排', i: '蘿蔔排.jpg', b: true, p: ['自從看了若杉奶奶的書，白蘿蔔的首順料理方式，就變成煎蘿蔔排，吃起來有熱量，蘿蔔風味特別飽滿。作法：切片中小火煎，用黑麻油最好，快熟了加點米酒，起鍋前少許醬油。']},
        {t: '豆薯酪梨沙拉', i: '豆薯酪梨沙拉.jpg'},
        {t: '蔬食咖哩', i: '蔬食咖哩.jpg', p: ['咖哩最有趣就是突發奇想，組合後，意外的更好吃--至今最豐盛協調的蔬食咖哩^_^', '材料：', '主婦聯盟的原生山藥、三色蔬菜、白花椰', '紫地瓜、喜願發芽黑豆、發芽黃豆', '塘塘廚房蔬食咖哩醬包']},
        {t: '青木瓜百香果', i: '青木瓜百香果.jpg', p: ['青木瓜刨絲不是很容易，但用削皮器就很簡單啦，跟百香果拌在一起就是清爽的小菜，要加點糖或果醋隨意。百香果佛手瓜也不錯。']},
        {t: '豆花茶碗蒸', i: '豆花茶碗蒸.jpg', p: ['想吃嫩嫩的茶碗蒸，但不想吃用蛋，靈機一動把名豐豆花放到味噌高湯裡（柴魚、主婦聯盟火鍋料、味噌），哇！幾乎就像在吃茶碗蒸，高湯加入米麵條、牛蒡蔬菜就是正餐了。吃素的人，豆花茶碗蒸加味噌、香菇煮友（鮮菇）、蔥花，也是很好的風味。當然和味噌豆腐湯滋味不同啦～']},
        {t: '海苔飯捲', i: '海苔飯捲.jpg', p: ['五分米加紫米，越嚼越香，飯捲愛什麼捲什麼，搭配吃滿樂趣的，五顏六色看著也很愉快。不用工具，攤平用手卷就行了。其中裡面的梅汁南瓜是小姑姑教我的，南瓜切薄片很快汆燙，泡梅汁/梅醋，清脆酸爽，好吃。']},
        {t: '薑汁南瓜豆花', i: '薑汁南瓜豆花.jpg', p: ['名豐豆腐拿來當豆花吃，豆香十足，加入自然農法薑汁蜜/溪底遙桂圓薑汁/棗道薑汁紅棗....方便的夏日甜點。']},
        {t: '漬蘿蔔', i: '漬蘿蔔.jpg', p: ['白蘿蔔、彩虹蘿蔔切薄片醃漬，甜甜的，夏天夾幾片配飯好清爽，糖鹽沒有比例，隨意做的，越放越好吃。也用味噌做一些，切片後直接埋進去。']},
        {t: '梅子番茄', i: '梅子番茄.jpg', p: ['番茄切半或用叉子戳洞，或直接丟下去煮，都試試看沒關係。']},
        {t: '家常便當', i: '家常便當.jpg', p: ['有段時間早上會去散步，先在家喝牛蒡油豆腐湯，散步再吃便當。昆布佃煮、彩虹蘿蔔漬、艾草破布子煎蛋、紅藜胚芽米飯。']},
        {t: '味噌雜煮', i: '味噌雜煮.jpg', p: ['味噌煮什麼都很好吃，蓮藕、芋頭、牛蒡、茄子、地瓜....', '第一鍋可以吃原味清湯，之後加薑片味噌、再來加豆瓣／韓式泡菜....一鍋多吃']},
        {t: '免煮洛神果醬', i: '免煮洛神果醬.jpg', p: ['半顆紅龍果皮切條、洛神果乾、少許紅龍果肉、檸檬汁，丟到果汁機打，就是新鮮速成果醬。加紅龍果肉是為了機器攪打方便，火龍果皮富膠質、無雜味，可運用任何紅色果醬，例如紅龍果皮鮮草莓醬、蘋果醬、草莓蔓越莓、草莓葡萄乾...新鮮好吃，不用加糖一直煮^^']},
        {t: '紅火龍果皮', i: '紅火龍果皮.jpg', p: ['自然農法、新鮮火龍果皮', '洗淨留下紅色的皮切細條，沒特殊味道，有膠質，可以當木耳絲用...搭配涼麵也很亮眼。']},
        {t: '自製米漿', i: '自製米漿.jpg', p: ['除了喝鹹濃湯，發芽玄米（糙米）粉以中小火乾炒加花生醬就是好喝的米漿！不用怕焦，反正一點焦也無所謂，還會更香。我加了白芝麻粒、黑芝麻粉一起炒，最後加點黃砂糖，非常好喝呀，濃稠版像麵茶，比外面調好的麵茶粉（我買過好幾種真材實料牌）要更好喝，而且是糙米粉營養又飽足，真是找到利用米粉的好方法了＾＾']},
        {t: '栗子豆漿', i: '栗子豆漿.jpg', p: ['顧名思義，可自行調配地瓜豆漿、黑芝麻豆漿、黑豆黃豆漿....愛加什麼加什麼。不過我這是買到太甜的栗子醬，混到自打的無糖豆漿裡。']},
        {t: '臭豆腐+辣腐乳', i: '臭豆腐+辣腐乳.jpg', p: ['自製臭豆腐常常不夠臭...湯汁跟豆腐要有風味，我加了加辣腐乳覺得很搭！']},
        {t: '芋頭燒飯', i: '芋頭燒飯.jpg', p: ['有種作法是所有生料和生米一起炒，再放電鍋蒸熟。我的做法是料炒熟拌煮好的米飯。蒜頭、香菇、豆包、醬油、海鹽，也許還有一點自然農法薑油，除了芋頭飯，換成長豆飯、高麗菜飯都很香。']}
      ]
    }
  }
}
</script>

<style>
#app {
  font-family: 'Avenir', Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}

.print-only {
  visibility: hidden !important;
  display: none !important;
}

@media print {
  .no-print {
    visibility: hidden !important;
    display: none !important;
    height: 0 !important;
  }
  .print-only {
    visibility: visible !important;
    display: block !important;
  }
  img, div, .card, .column {
    page-break-inside: avoid !important;
  }
}

a, button, .clickable {
  cursor: pointer !important;
}

.ui.card {
  box-shadow: grey 0px 1px 5px 1px;
}

@media screen and (max-width: 600px) {
  .fat-only {
    display: none !important;
  }
  .button {
    max-width: 100% !important;
  }
}

@media screen and (max-width: 991px) {
  .fater-only {
    display: none !important;
  }
}

@media screen and (min-width: 601px) {
  .thin-only {
    display: none !important;
  }
}

.router-link-active {
  background-color: #ccf !important;
}
</style>
