<template lang="jade">
  #app
    .ui.menu
      router-link.item(to="/" exact='')
        i.home.icon
        span.fat-only 首頁
      router-link.item(to="/foods" exact='')
        i.book.icon
        span.fat-only 食譜
      router-link.item(to="/thoughts" exact='')
        i.comments.icon
        span.fat-only 飲食小記
      router-link.item(to="/baby" exact='')
        i.user.icon
        span.fat-only 嬰幼兒
        span.fat-only 食譜
      router-link.item(to="/outer" exact='')
        i.sign.language.icon
        span.fat-only 資源
      .right.menu.fat-only
        .item
          iframe(src="https://www.facebook.com/plugins/share_button.php?href=https%3A%2F%2Ffood.bestian.tw&layout=button&size=small&mobile_iframe=true&appId=485195848253155&width=63&height=20" width="63" height="20" style="border:none;overflow:hidden" scrolling="no" frameborder="0" allowTransparency="true" allow="encrypted-media")
    #main
      router-view(:foods = "foods")
</template>

<script>
export default {
  name: 'App',
  data () {
    return {
      foods: [
        {
          t: '絲瓜蛤蠣湯',
          i: '絲瓜蛤蠣湯.jpg',
          p: [
            '絲瓜削皮，半月切',
            '與蛤蠣一起煮',
            '加一點鹽'
          ]},
        {
          t: '青木瓜、玉米、蓮藕雜煮',
          i: '青木瓜、玉米、蓮藕雜煮.jpg',
          p: [
            '青木瓜、玉米、蓮藕切丁',
            '把它們煮在一起']},
        {
          t: '南瓜湯',
          b: true,
          i: '南瓜湯.jpg',
          p: [
            '南瓜切丁',
            '煮熟']},
        {
          t: '米糠茴香煎餅',
          i: '米糠茴香煎餅.jpg',
          p: [
            '米糠粉、麵粉、新鮮茴香',
            '米糠與麵粉大約1:2，似乎再多一點也OK',
            '不用任何調味，細細咀嚼，有微甜，很好吃']},
        {t: '香蕉米煎餅', i: '餅.jpg'},
        {t: '紅豆地瓜麻糬', i: '紅豆地瓜麻糬.jpg'},
        {t: '米糕', b: true, i: '米糕.jpg'},
        {t: '紅藜薑黃蘿蔔糕',
          i: '紅藜薑黃蘿蔔糕.jpg',
          b: true,
          p: ['蘿蔔糕加了在來米、梗米、地瓜粉',
            '（在來米1.5碗、梗米0.5碗、地瓜粉大約半碗吧，每種都是隨興加的）',
            '口感Q嫩，非常像早餐店那種軟軟的蘿蔔糕，下次要用這個配方做芋頭粿～']},
        {t: '牛蒡紅豆年糕',
          i: '紅豆年糕.jpg',
          b: true,
          p: ['這次是加糯米、梗米、台灣紅藜、地瓜粉',
            '紅豆有先催芽',
            '順手加入乾燥牛蒡煮的水、黑糖',
            '蒸熟後，融合在一起的味道很棒',
            '外面賣的年糕都太甜了！',
            '自製年糕／麻糬真的又快又好吃喲，經濟實惠^_^']},
        {t: '芭蕉+芝麻椰奶\n米布丁',
          i: '米布丁.jpg',
          p: ['冷水、米粉、冷水煮沸',
            '以上以碗為單位，2:2:2',
            '比例上，水可以再多一點，口感比較嫩，例如水改3碗。',
            'A :冷水拌在來米粉（有其他料等拌勻再放，或料先放B，避免米粉結塊。）可直接試味道，嚐起來不夠甜再加糖。',
            'B :將A倒入煮沸熱水中慢慢攪拌（均勻中小火），有些稠度後，放入容器，電鍋蒸熟。',
            '剛蒸熟太軟，放涼口感較好。']},
        {t: '椰奶紅豆米布丁', i: '椰奶紅豆米布丁.jpg'},
        {t: '麻糬+炒紅豆沙', i: '麻糬+炒紅豆沙.jpg', b: true, p: ['糯米先浸泡，打成漿後蒸熟。這種做法，白糯米黏性比紫糯米、糯小米高，因此後兩種口味，建議混搭白糯米打漿。', '炒紅豆沙：煮好的紅豆撈出來，只要水瀝乾、均勻小火，炒起來很快乾，要多甜，自在隨意。自己做的紅豆沙麻糬超級好吃。']},
        {t: '小米麻糬', i: '小米麻糬.jpg', b: true, p: ['小米麻糬沾白芝麻，餡料是金時芋+蘋婆，再加點二號砂調味。這個餡料本身當甜點很好吃。']},
        {t: '味噌蔬菜烏龍麵', i: '味噌蔬菜烏龍麵.jpg', b: true, p: ['加了台灣藜、少許芋頭、海苔。味噌和芋頭很搭配。']},
        {t: '蘋婆黃醬燉飯', i: '蘋婆黃醬燉飯.jpg', b: true, p: ['買到不甜、沙沙、直接吃沒啥味道的地瓜，最適合鹹煮，例如做紅燒油豆包。這次把不甜的地瓜跟蘋婆一起打泥，口感溫和綿密，煮蔬菜濃湯、燉飯、義大利麵都非常好吃（這款黃醬煮蔬食特別契合，裡裡外外透著一股溫和']},
        {t: '薑黃烤餅', i: '薑黃烤餅.jpg', b: true, p: ['上下游市集的「台灣好好小麥粉」、福和自然田園的薑黃粉，直接用鐵鍋乾煎就是好吃的捲餅，訣竅是餅皮要薄一點，拍點麵粉不黏手再煎，風味有點像外面賣的印度甩餅，乾麵粉有烤過的香氣，餅皮脆中帶軟有嚼勁，有點薑黃香氣。煎薄餅很快。']},
        {t: '藜麥酪梨沙拉', i: '藜麥酪梨沙拉.jpg', b: true, p: ['酪梨、番茄、小黃瓜、地瓜、蘋果', '拌上無奶蛋的沙拉醬', '是我最近的早餐', '下次加點白藜麥：）', '同樣原料，改淋芥末醬油、泰式酸辣醬也不錯', '買了點潤餅皮，抹上芝麻醬，小太陽說要捲成像蛋捲那樣吃：）']},
        {t: '中式蛋捲潤餅皮', i: '中式蛋捲潤餅皮.jpg', b: true, p: ['潤餅皮可冷凍，直接退冰或電鍋稍微蒸過即可食。用蒸氣潤過的餅皮口感較好。愛抹什麼醬，隨意抹。比吐司Q、薄、有嚼勁，好入味很適合當點心呢～']},
        {t: '芝麻卷', i: '芝麻卷.jpg'},
        {t: '綠茶麻糬+紅豆', i: '綠茶麻糬+紅豆.jpg', b: true},
        {t: '宇宙紫甜湯', i: '宇宙紫甜湯.jpg', b: true, p: ['小太陽想吃「宇宙紫」的麻糬', '弄了甜菜根+蝶豆花染的紫色甜湯', '甜菜根是之前當季買的，打汁後罐裝冷凍，染色滿好用的。（包括麵團黏土）', '鍋裡的深色沈澱是打碎的甜菜根']},
        {t: '薑黃椰油抹醬', i: '薑黃椰油抹醬.jpg', b: true, p: ['薑黃粉+黑糖+椰油拌勻當麵包抹醬（非常非常好吃！）']},
        {t: '雙色紅豆麻糬', i: '雙色紅豆麻糬.jpg', b: true},
        {t: '牛蒡桂圓紅豆湯麻糬', i: '牛蒡桂圓紅豆湯麻糬.jpg', b: true},
        {t: '葉子蒸飯', i: '葉子蒸飯.jpg', b: true, p: ['野薑花葉裹-胚芽小米飯', '搭配南瓜杏香菇鹹蛋食用', '又快要端午節了，我覺得如果是一家人吃一餐，這樣吃個『大餅粽』也滿有Fu的啦，不用一個個捆了又拆，而且葉子飯滿有Fu的～', '一種不需要研究粽子包法的新樂趣', '也可以用任何食用薑的葉子、芭蕉、荷花、月桃葉試試', '月桃葉的香氣十分獨特，怎麼包都會入味，野薑花葉的優點是特別軟，放進鍋子好擺放。', '照片中是梗米，不是糯米，比較好消化，', '另加了小米，讓葉子與米飯間更密實。', '煮飯比例的水量即可，也可以多點水，讓米飯比較濕潤、入味。', '葉片不需抹油，完全不沾黏。包好後，最上方壓個盤子、蓋上鍋蓋，悶煮更入味~', '曾經嘗試過的還有：', '月桃葉：南瓜小米飯（原味／鹹味-加菜脯、紅蔥頭、香菇）', '粽葉：紅藜紅豆栗子／南瓜粽（原味／鹹味）']},
        {t: '紫米粽葉炊飯', i: '紫米粽葉炊飯.jpg', p: ['蒸好打開來有點像昆布，哈！', '原味葉子飯香單純，想吃鹹就拌點炒料，吃甜的就沾黑糖粉，很彈性。']},
        {t: '紅藜香蕉飯', i: '紅藜香蕉飯.jpg', p: ['紅藜香蕉飯（香蕉、黑糖適量，以香蕉葉包飯）', '米我是用四季耕讀的五分米（糙米殼去一半的米），不用糯米']},
        {t: '椰奶白醬燉飯', i: '椰奶白醬燉飯.jpg', b: true, p: ['省時料理，加個水把冷凍馬鈴薯丁、三色蔬菜、剩飯（紅藜胚芽米）煮一煮，加上水、椰奶、高麗菜調味就行了。 ', '完全就是白醬奶香風味喔^^']},
        {t: '椰奶南瓜紅豆（鹹）', i: '椰奶南瓜紅豆（鹹）.jpg', p: ['鹹的椰奶南瓜蔬菜、蒸紅豆', '紅豆作主食配。', '好像是某天的一餐。']},
        {t: '椰奶白醬-蔬菜燉煮', i: '椰奶白醬-蔬菜燉煮.jpg', b: true, p: ['椰奶適合做白醬，不想吃太多鮮奶油、又喜歡白醬風味的可以參考。']},
        {t: '南瓜義大利麵', i: '南瓜義大利麵.jpg', b: true, p: ['椰奶南瓜義麵，非常好吃（口水）']},
        {t: '椰奶紅豆－黑糖麻糬', i: '椰奶紅豆－黑糖麻糬.jpg', b: true, p: ['從鍋子切一片冷藏麻糬，有點像蛋糕切片www', '（當然要再蒸過才能吃啦！只是拍照好看~）', '加了點黑糖的麻糬']},
        {t: '椰奶紅糯米麻糬', i: '椰奶紅糯米麻糬.jpg', b: true, p: ['紅糯米+白糯米製程的麻糬', '淋上椰奶、黑糖，非常有南洋風味喔！']},
        {t: '紅糯米麻糬', i: '紅糯米麻糬.jpg', b: true, p: ['紅糯米、白糯米、梗米混搭的黑糖麻糬', '超級推薦', '紅糯米麻糬香氣非常棒']},
        {t: '香蕉煎餅', i: '香蕉煎餅.jpg', b: true, p: ['香蕉、地瓜粉、糙米粉、極少許水', '全部拌在一起油煎，甜甜香香的。有陣子我們全家吃超級多。']},
        {t: '米疙瘩', i: '米疙瘩.jpg', b: true, p: ['跟麵疙撘一樣，非常快熟，口感好，充滿淡淡芋米香，適合想吃米食又沒煮飯的人。方便。']},
        {t: '芋頭鹹粿', i: '芋頭鹹粿.jpg', b: true, p: ['因為不想吃全糯米，因此加了梗米一起打漿作粿。', '訣竅是將打好的米漿放置一段時間，倒掉浮在上方的水，增加米漿濃稠度，再拌入鹹鹹的炒料（湯汁不要太多），放電鍋蒸熟，這就行啦！', '鍋子裡如果墊著月桃葉一起蒸，另有一番風味喲～']},
        {t: '南瓜小米粥', i: '南瓜小米粥.jpg', b: true, p: ['溫和的南瓜小米粥']},
        {t: '鷹嘴豆＋燕麥胚芽米飯', i: '鷹嘴豆＋燕麥胚芽米飯.jpg', b: true},
        {t: '紅豆湯', i: '紅豆湯.jpg', b: true, p: ['紅豆湯（紅棗、南瓜、栗子、地瓜）', '紅豆湯的湯頭，我喜歡加點乾燥牛蒡', '有時候會加點自製麻糬、薑粉。']},
        {t: '椰棗燕麥粥', i: '椰棗燕麥粥.jpg', b: true, p: ['椰棗跟椰子沒有關係', '是另一種植物', '果實非常甜可以當代糖，風味溫和，有它迷人之處', '我通常把椰棗切一切加點水，用果汁機打椰棗醬，用途很廣。', '用椰棗調味的燕麥粥非常好吃。粥裡好像也有加點南瓜／地瓜。']},
        {t: '蓮藕燕麥粥', i: '蓮藕燕麥粥.jpg', b: true, p: ['先煮蓮藕，等蓮藕煮好再加燕麥粒也OK', '因為蓮藕不怕燉煮，燕麥粒很好煮熟，煮久會爆開，一樣好吃有嚼感。', '燕麥粒可以事先浸泡，也可以不浸泡直接煮，', '蓮藕燕麥煮出來的原味高湯超好喝，當嬰兒副食品很棒。', '燕麥粒煮水的湯，冷藏隔天會有膠質凍呢，紅豆燕麥粒的高湯也很棒。', '雜糧清煮的好處是沒吃完的話，隔天打漿、簡單調味也是很好的飲料／點心。（像是芋頭、胚芽米打漿後加椰奶、黑糖也很美味！）']},
        {t: '薑黃糙米飯\n（煎蘿蔔排、蔬菜）', i: '薑黃糙米飯.jpg', b: true, p: ['超超超超好吃的蘿蔔排，煎好的麻油炒青菜，配上糙米飯、灑點薑黃粉，哇！！！']},
        {t: '蔬食隨手煮', i: '蔬食隨手煮.jpg', p: ['（喜願米麵條）拌紫蘇葉、醬油等調味', '絲瓜蔬菜', '牛蒡紅藜清湯']},
        {t: '南瓜米糕', i: '南瓜米糕.jpg', b: true, p: ['南瓜米糕配新鮮的亞麻仁油、醬油']},
        {t: '薑黃鮮菇飯', i: '薑黃鮮菇飯.jpg', b: true, p: ['鮮菇直接用手撕開加點鹽拌炒，加入薑黃粉、少許水，最後直接和煮好的米飯拌在一起。不習慣薑黃味就少加一點，適合慢慢咀嚼，有淡淡香氣的拌飯。從《幸福市集》這本書學的做法，裡面有簡單又好吃的原味料理～']},
        {t: '黃耆當歸蔬麵', i: '黃耆當歸蔬麵.jpg', b: true, p: ['黃耆、當歸、紅棗湯底，濾過留下紅棗，加名豐油豆包、鮮菇、青菜，就是好吃的蔬食補湯麵^_^']},
        {t: '味噌湯＆烏龍麵', i: '味噌湯＆烏龍麵.jpg', b: true, p: ['茄子吸油，加入油豆包和花椰菜很對味，這款味噌湯我會煮兩餐份，隔天再加點味噌，拌入烏龍麵和馬鈴薯，濃郁的烏龍湯麵。']},
        {t: '樹豆料理', i: '樹豆料理.jpg', b: true, p: ['從樹上結莢採集、非常非常棒的豆子，只要自然農法市集有看到都會買！本身有自己的豆子香氣，較硬，建議先泡水，我通常會先用電鍋煮熟，煮米飯或煮料理再丟下去一起煮，吃起來比較軟。一次燉久一點也會軟。', '吃樹豆會長精神喲，有蛋白質和各種營養，也很有飽食感，咀嚼樹豆，總有一種完整的滿足喜悅，身體好像在跟我傳達，是的，我就是想吃這樣的食物！', '我煮過樹豆青木瓜湯、紅燒湯、咖哩、樹豆排骨...各有風味，其實直接加到米飯裡煮就很好吃，雖然已經煮軟，但大腦意識到要嚼豆子，吃飯也會放慢品嚐。']},
        {t: '天貝南瓜蔬菜麵', i: '天貝南瓜蔬菜麵.jpg', b: true, p: ['照片中是紅豆天貝、黃豆天貝天貝吃起來有點鮮菇的味道。它本來就是菌跟豆子作用的發酵食品，像納豆那樣。天貝要另外煎，跟煎豆干類似，吃起來帶著油香。']},
        {t: '紅豆天貝+蔬菜糙米飯', i: '紅豆天貝+蔬菜糙米飯.jpg'},
        {t: '月桃南瓜小米飯', i: '月桃南瓜小米飯.jpg', b: true, p: ['微微鹹的月桃南瓜小米飯（五分米、小米、南瓜、香菇、紅蔥頭、菜脯）', '我是用煮好的飯XD只是好玩，試試看包入葉中冷凍，當成粽子飯吃。']},
        {t: '粽葉、香蕉葉、月桃葉', i: '粽葉、香蕉葉、月桃葉.jpg', p: ['由左至右', '粽葉、香蕉葉、月桃葉']},
        {t: '豆鼓炒黑豆芽', i: '豆鼓炒黑豆芽.jpg', p: ['自己種的黑豆芽菜']},
        {t: '秈稻薑黃飯', i: '秈稻薑黃飯.jpg', b: true, p: ['薑黃飯煮好後，抹一點鹽麴，配上碗豆、蔬菜，也可以加少許冷壓椰油，令人驚豔的清爽美味。']},
        {t: '納豆山藥泥', i: '納豆山藥泥.jpg', b: true, p: ['生山藥泥非常綿密，加上海苔、醬油當主食，好搭配。']},
        {t: '糙米納豆飯', i: '糙米納豆飯.jpg', b: true},
        {t: '味噌薑醋海帶飯', i: '味噌薑醋海帶飯.jpg', b: true, p: ['味噌、蘿蔔泥、薑醋、海帶醬與米飯拌勻，吃起來像壽司飯糰，很清爽，搭配玉米、豌豆莢、蔬菜盤...這是去陽明山探路的野餐便當^^']}
      ]
    }
  }
}
</script>

<style>
#app {
  font-family: 'Avenir', Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}

.print-only {
  visibility: hidden !important;
  display: none !important;
}

@media print {
  .no-print {
    visibility: hidden !important;
    display: none !important;
    height: 0 !important;
  }
  .print-only {
    visibility: visible !important;
    display: block !important;
  }
  img, div, .card, .column {
    page-break-inside: avoid !important;
  }
}

a, button, .clickable {
  cursor: pointer !important;
}

.ui.card {
  box-shadow: grey 0px 1px 5px 1px;
}

@media screen and (max-width: 600px) {
  .fat-only {
    display: none !important;
  }
  .button {
    max-width: 100% !important;
  }
}

@media screen and (max-width: 991px) {
  .fater-only {
    display: none !important;
  }
}

@media screen and (min-width: 601px) {
  .thin-only {
    display: none !important;
  }
}

.router-link-active {
  background-color: #ccf !important;
}
</style>
